Revit 2027 API
ParameterTypeId.AnalyticalModelEndAlignmentMethod Property
 "End Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelEndAlignmentMethod { get; }
Public Shared ReadOnly Property AnalyticalModelEndAlignmentMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelEndAlignmentMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelEndAlignmentMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace